const assert = require('assert');
const n2words = require('../dist/n2words.min.js');

const testCasesUkrainian = [
  [0, 'нуль'],
  [1, 'один'],
  [2, 'два'],
  [3, 'три'],
  [11, 'одинадцять'],
  [12, 'дванадцять'],
  [16, 'шiстнадцять'],
  [19, "дев'ятнадцять"],
  [20, 'двадцять'],
  [21, 'двадцять один'],
  [26, 'двадцять шiсть'],
  [28, 'двадцять вiсiм'],
  [30, 'тридцять'],
  [31, 'тридцять один'],
  [40, 'сорок'],
  [44, 'сорок чотири'],
  [50, "п'ятдесят"],
  [55, "п'ятдесят п'ять"],
  [60, 'шiстдесят'],
  [67, 'шiстдесят сiм'],
  [70, 'сiмдесят'],
  [79, "сiмдесят дев'ять"],
  [89, "вiсiмдесят дев'ять"],
  [95, "дев'яносто п'ять"],
  [100, 'сто'],
  [101, 'сто один'],
  [199, "сто дев'яносто дев'ять"],
  [203, 'двiстi три'],
  [287, 'двiстi вiсiмдесят сiм'],
  [356, "триста п'ятдесят шiсть"],
  [400, 'чотириста'],
  [434, 'чотириста тридцять чотири'],
  [578, "п'ятсот сiмдесят вiсiм"],
  [689, "шiстсот вiсiмдесят дев'ять"],
  [729, "сiмсот двадцять дев'ять"],
  [894, "вiсiмсот дев'яносто чотири"],
  [999, "дев'ятсот дев'яносто дев'ять"],
  [1000, 'одна тисяча'],
  [1001, 'одна тисяча один'],
  [1097, "одна тисяча дев'яносто сiм"],
  [1104, 'одна тисяча сто чотири'],
  [1243, 'одна тисяча двiстi сорок три'],
  [2385, "двi тисячi триста вiсiмдесят п'ять"],
  [3766, 'три тисячi сiмсот шiстдесят шiсть'],
  [4196, "чотири тисячi сто дев'яносто шiсть"],
  [5846, "п'ять тисяч вiсiмсот сорок шiсть"],
  [6459, "шiсть тисяч чотириста п'ятдесят дев'ять"],
  [7232, 'сiм тисяч двiстi тридцять два'],
  [8569, "вiсiм тисяч п'ятсот шiстдесят дев'ять"],
  [9539, "дев'ять тисяч п'ятсот тридцять дев'ять"],
  [1000000, 'один мiльйон'],
  [1000001, 'один мiльйон один'],
  [4000000, 'чотири мiльйони'],
  [10000000000000, 'десять трильйонiв'],
  [100000000000000, 'сто трильйонiв'],
  [1000000000000000000, 'один квiнтильйон']
]


describe('Ukrainian', function () {
  it('should convert numbers correctly (Ukrainian)', function () {
    for (let i = 0; i < testCasesUkrainian.length; i++) {
      assert.equal(n2words(testCasesUkrainian[i][0], { lang: 'uk' }), testCasesUkrainian[i][1])
    }
  });
});
