export const ones = [
  '',
  'واحد',
  'اثنان',
  'ثلاثة',
  'أربعة',
  'خمسة',
  'ستة',
  'سبعة',
  'ثمانية',
  'تسعة',
  'عشرة',
  'أحد عشر',
  'اثنا عشر',
  'ثلاثة عشر',
  'أربعة عشر',
  'خمسة عشر',
  'ستة عشر',
  'سبعة عشر',
  'ثمانية عشر',
  'تسعة عشر',
];

export const feminineOnes = [
  '',
  'إحدى',
  'اثنتان',
  'ثلاث',
  'أربع',
  'خمس',
  'ست',
  'سبع',
  'ثمان',
  'تسع',
  'عشر',
  'إحدى عشرة',
  'اثنتا عشرة',
  'ثلاث عشرة',
  'أربع عشرة',
  'خمس عشرة',
  'ست عشرة',
  'سبع عشرة',
  'ثماني عشرة',
  'تسع عشرة',
];

export const tens = [
  'عشرون',
  'ثلاثون',
  'أربعون',
  'خمسون',
  'ستون',
  'سبعون',
  'ثمانون',
  'تسعون',
];

export const hundreds = [
  '',
  'مائة',
  'مئتان',
  'ثلاثمائة',
  'أربعمائة',
  'خمسمائة',
  'ستمائة',
  'سبعمائة',
  'ثمانمائة',
  'تسعمائة',
];

export const appendedTwos = [
  'مئتا',
  'ألفا',
  'مليونا',
  'مليارا',
  'تريليونا',
  'كوادريليونا',
  'كوينتليونا',
  'سكستيليونا',
];

export const twos = [
  'مئتان',
  'ألفان',
  'مليونان',
  'ملياران',
  'تريليونان',
  'كوادريليونان',
  'كوينتليونان',
  'سكستيليونان',
];

export const groups = [
  'مائة',
  'ألف',
  'مليون',
  'مليار',
  'تريليون',
  'كوادريليون',
  'كوينتليون',
  'سكستيليون',
];

export const appendedGroups = [
  '',
  'ألفاً',
  'مليوناً',
  'ملياراً',
  'تريليوناً',
  'كوادريليوناً',
  'كوينتليوناً',
  'سكستيليوناً',
];

export const pluralGroups = [
  '',
  'آلاف',
  'ملايين',
  'مليارات',
  'تريليونات',
  'كوادريليونات',
  'كوينتليونات',
  'سكستيليونات',
];

export default {};
