/**
 * Cardinal number test cases
 * Format: [input, expected_output, options?]
 */
export const cardinal = [
  [0, 'শূন্য'],
  [1, 'এক'],
  [2, 'দুই'],
  [3, 'তিন'],
  [5.5, 'পাঁচ দশমিক পাঁচ'],
  ['0.01', 'শূন্য দশমিক শূন্য এক'],
  ['0.005', 'শূন্য দশমিক শূন্য শূন্য পাঁচ'],
  [3.14, 'তিন দশমিক চৌদ্দ'],

  [-5, 'মাইনাস পাঁচ'],
  [-17.42, 'মাইনাস সতেরো দশমিক বেয়াল্লিশ'],

  [10, 'দশ'],
  [11, 'এগারো'],
  [15, 'পনেরো'],
  [19, 'উনিশ'],
  [20, 'বিশ'],
  [21, 'একুশ'],
  [25, 'পঁচিশ'],
  [29, 'উনত্রিশ'],
  [30, 'ত্রিশ'],
  [33, 'তেত্রিশ'],
  [40, 'চল্লিশ'],
  [42, 'বেয়াল্লিশ'],
  [50, 'পঞ্চাশ'],
  [58, 'আটান্ন'],
  [60, 'ষাট'],
  [68, 'আটষট্টি'],
  [70, 'সত্তর'],
  [79, 'উনআশি'],
  [80, 'আশি'],
  [90, 'নব্বই'],
  [99, 'নিরানব্বই'],

  [100, 'এক শত'],
  [101, 'এক শত এক'],
  [110, 'এক শত দশ'],
  [125, 'এক শত পঁচিশ'],
  [200, 'দুই শত'],
  [215, 'দুই শত পনেরো'],
  [999, 'নয় শত নিরানব্বই'],

  [1000, 'এক হাজার'],
  [1001, 'এক হাজার এক'],
  [1010, 'এক হাজার দশ'],
  [1100, 'এক হাজার এক শত'],
  [1234, 'এক হাজার দুই শত চৌত্রিশ'],
  [10_000, 'দশ হাজার'],
  [50_000, 'পঞ্চাশ হাজার'],
  [99_999, 'নিরানব্বই হাজার নয় শত নিরানব্বই'],

  [100_000, 'এক লাখ'],
  [123_456, 'এক লাখ তেইশ হাজার চার শত ছাপ্পান্ন'],
  [999_999, 'নয় লাখ নিরানব্বই হাজার নয় শত নিরানব্বই'],

  [1_000_000, 'দশ লাখ'],
  [10_000_000, 'এক কোটি'],
  [12_345_678, 'এক কোটি তেইশ লাখ পঁয়তাল্লিশ হাজার ছয় শত আটাত্তর'],
  [99_99_99_999n, 'নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয় শত নিরানব্বই'],

  [1_00_00_00_000n, 'এক আরব'],
  [100_000_000_000n, 'এক খরব'],
  [1_000_000_000_000n, 'দশ খরব'],
  [9_22_33_44_55_66_77n, 'বিরানব্বই খরব তেইশ আরব চৌত্রিশ কোটি পঁয়তাল্লিশ লাখ ছাপ্পান্ন হাজার ছয় শত সাতাত্তর']
]
