/**
 * Cardinal number test cases
 * Format: [input, expected_output, options?]
 */
export const cardinal = [
  [0, 'صفر'],
  [1, 'ایک'],
  [2, 'دو'],
  [5.5, 'پانچ اعشاریہ پانچ'],
  ['0.05', 'صفر اعشاریہ صفر پانچ'],
  [-17, 'منفی سترہ'],
  [10, 'دس'],
  [11, 'گیارہ'],
  [19, 'انیس'],
  [20, 'بیس'],
  [21, 'اکیس'],
  [45, 'پینتالیس'],
  [58, 'اٹھاون'],
  [73, 'تہتر'],
  [99, 'ننانوے'],
  [100, 'ایک سو'],
  [101, 'ایک سو ایک'],
  [215, 'دو سو پندرہ'],
  [999, 'نو سو ننانوے'],
  [1000, 'ایک ہزار'],
  [10_000, 'دس ہزار'],
  [100_000, 'ایک لاکھ'],
  [1_000_000, 'دس لاکھ'],
  [12_34_56_789n, 'بارہ کروڑ چونتیس لاکھ چھپن ہزار سات سو نواسی']
]
